In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('./shopping_data.csv')

In [3]:
df.drop(['invoice_date', 'customer_id', 'invoice_no'], axis=1,
        inplace=True)

,gender,age,category,quantity,price,payment_method,shopping_mall
0,Female,28,Clothing,5,1500.40,Credit Card,Kanyon
1,Male,21,Shoes,3,1800.51,Debit Card,Forum Istanbul
2,Male,20,Clothing,1,300.08,Cash,Metrocity
3,Female,66,Shoes,5,3000.85,Credit Card,Metropol AVM
4,Female,53,Books,4,60.60,Cash,Kanyon
...,...,...,...,...,...,...,...
99451,Male,27,Food & Beverage,2,10.46,Cash,Forum Istanbul
99452,Female,23,Food & Beverage,1,5.23,Debit Card,Mall of Istanbul
99453,Male,63,Food & Beverage,2,10.46,Debit Card,Metrocity
99454,Male,56,Technology,4,4200.00,Cash,Istinye Park
99455,Female,36,Souvenir,3,35.19,Credit Card,Mall of Istanbul

In [4]:
df.to_csv("data.csv", sep=',', index=False, encoding='utf-8')

In [5]:
df

In [7]:
def update(row):
    row['price'] = row['price'] / row['quantity']
    return row

In [8]:
df = df.apply(update, axis=1)

       gender  age         category    price
0      Female   28         Clothing   300.08
1        Male   21            Shoes   600.17
2        Male   20         Clothing   300.08
3      Female   66            Shoes   600.17
4      Female   53            Books    15.15
...       ...  ...              ...      ...
99451    Male   27  Food & Beverage     5.23
99452  Female   23  Food & Beverage     5.23
99453    Male   63  Food & Beverage     5.23
99454    Male   56       Technology  1050.00
99455  Female   36         Souvenir    11.73

[99456 rows x 4 columns]

In [10]:
df.drop(['invoice_date', 'customer_id', 'invoice_no', 'shopping_mall', 'payment_method', 'quantity'], axis=1, inplace=True)

In [39]:
df

       gender  age         category    price
0      Female   28         Clothing   300.08
1        Male   21            Shoes   600.17
2        Male   20         Clothing   300.08
3      Female   66            Shoes   600.17
4      Female   53            Books    15.15
...       ...  ...              ...      ...
99452  Female   45         Souvenir    11.73
99453    Male   27  Food & Beverage     5.23
99454    Male   63  Food & Beverage     5.23
99455    Male   56       Technology  1050.00
99456  Female   36         Souvenir    11.73

[99457 rows x 4 columns]

In [40]:
df.to_csv("processed_shopping_data.csv", sep=',', index=False, encoding='utf-8')